#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.data.archive_file.lambda_zip: Reading...
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.lambda_zip: Read complete after 0s [id=b76ef36d86b36c4f8cba8621da7eb98b79b6a324]
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=10652cfa7e7e872dc12afe1f4bdea597fa58acf1]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=khqpyv]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 1s [id=3ec3c019b95c77edede08d1749bbd8c9c6e539c9]
module.backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-OPTIONS]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-GET]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-dev]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-GET]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=7ia3cs]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=9ebf127f4251f8d1098d9b223024616c10c89532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backend.aws_api_gateway_integration.webhook_integration will be created
  + resource "aws_api_gateway_integration" "webhook_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "us-east-2"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "g6jnm33pu7"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.backend.aws_api_gateway_method.webhook_post will be created
  + resource "aws_api_gateway_method" "webhook_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "us-east-2"
      + resource_id      = (known after apply)
      + rest_api_id      = "g6jnm33pu7"
    }

  # module.backend.aws_api_gateway_resource.webhook will be created
  + resource "aws_api_gateway_resource" "webhook" {
      + id          = (known after apply)
      + parent_id   = "rv8oylouqe"
      + path        = (known after apply)
      + path_part   = "webhook"
      + region      = "us-east-2"
      + rest_api_id = "g6jnm33pu7"
    }

  # module.backend.aws_lambda_function.stripe_webhook will be created
  + resource "aws_lambda_function" "stripe_webhook" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../../modules/vstshop/backend/lambda/stripe_webhook.zip"
      + function_name                  = "vstshop-stripe-webhook-dev"
      + handler                        = "stripe_webhook.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::195481994910:role/vstshop-lambda-role-dev"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "7jvgowVivf/6+JmQLkgRS9ALSy0fNz5arZFPErUTLWc="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "STRIPE_SECRET_KEY"     = (sensitive value)
              + "STRIPE_WEBHOOK_SECRET" = (sensitive value)
              + "TABLE_NAME"            = "vstshop-purchases-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer will be created
  + resource "aws_lambda_layer_version" "stripe_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../../modules/vstshop/backend/stripe_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "vstshop-stripe-layer-dev"
      + region                      = "us-east-2"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "25a2gRMzxXjYUUPD4s4nyiF6dhROE2WiOJ2HEjY7+Kk="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.backend.aws_lambda_permission.apigw_webhook will be created
  + resource "aws_lambda_permission" "apigw_webhook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vstshop-stripe-webhook-dev"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = "arn:aws:execute-api:us-east-2:195481994910:g6jnm33pu7/*/*"
      + statement_id        = "AllowExecutionFromAPIGatewayWebhook"
      + statement_id_prefix = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>